CREATE TABLE Movies (
                        id INT IDENTITY(1,1) PRIMARY KEY,
                        title NVARCHAR(255) NOT NULL,
                        KinopoiskRating FLOAT,
                        KinopoiskVotes INT,
                        lists NVARCHAR(MAX),
                        ReleaseDate NVARCHAR(50),
                        country NVARCHAR(100),
                        director NVARCHAR(100),
                        genre NVARCHAR(255),
                        quality NVARCHAR(50),
                        AgeRating NVARCHAR(50),
                        duration NVARCHAR(50),
                        series NVARCHAR(MAX),
                        description NVARCHAR(MAX),
                        PosterUrl NVARCHAR(MAX),
                        TrailerUrl NVARCHAR(MAX)
);

INSERT INTO Movies (
    title, KinopoiskRating, KinopoiskVotes, lists, ReleaseDate, country, director,
    genre, quality, AgeRating, duration, series, description, PosterUrl, TrailerUrl
)
VALUES
    ('Жизнь человека. Последнее интервью', 9.21, 30413,
     'Лучшие документальные фильмы 2020 года (1 место), Лучшие русские фильмы 2020 года (1 место)',
     '5 января 2021 года', 'Россия', 'Сергей Карпов',
     'Документальные, Русские', '720p', '18+ только для взрослых', '88 мин',
     'Фильмы 2020 года, Фильмы о смысле жизни, Фильмы основанные на реальных событиях, Фильмы про врачей или болезни',
     'Документальный фильм о последних годах жизни Андрея Павленко...',
     'assets/img/films/life.jpg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('Побег из Шоушенка', 9.11, 1051840,
     'Лучшие драмы 1994 года (1 место), Лучшие фильмы про криминал 1994 года (1 место), Лучшие зарубежные фильмы 1994 года (1 место)',
     '10 сентября 1994 года', 'США', 'Фрэнк Дарабонт',
     'Драмы, Криминал, Зарубежные', '720p', '16+ для более зрелых и понимающих', '142 мин.',
     'Лучшие фильмы с неожиданной развязкой, Лучшие экранизации литературных произведений, Фильмы про дружбу, Фильмы про побег, Фильмы про тюрьму, Экранизации произведений Стивена Кинга',
     'В основу культовой драмы легла повесть Стивена Кинга...',
     'assets/img/films/shoushenk.jpg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('Зеленая миля', 9.08, 1015609,
     'Лучшие драмы 1999 года (1 место), Лучшие детективы 1999 года (1 место), Лучшие фэнтези 1999 года (1 место), Лучшие фильмы про криминал 1999 года (1 место), Лучшие зарубежные фильмы 1999 года (1 место)',
     '6 декабря 1999 года', 'США', 'Фрэнк Дарабонт',
     'Драмы, Детективы, Фэнтези, Криминал, Зарубежные', '720p', '16+ для более зрелых и понимающих', '189 мин.',
     'Лучшие экранизации литературных произведений, Фильмы про тюрьму, Экранизации произведений Стивена Кинга',
     'Картина снята по одноименному роману Стивена Кинга...',
     'assets/img/films/green.jpg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('Милен Фармер', 9.03, 955,
     'Лучшие документальные фильмы 2009 года (1 место), Лучшие зарубежные фильмы 2009 года (1 место)',
     '2009', 'Франция', 'Франсуа Ансс',
     'Документальные, Зарубежные', '720p', '18', '139 мин.',
     'Фильмы о музыке, Фильмы про певцов',
     'С выходом седьмого студийного альбома «Point de Suture» у французской поп-дивы Милен Фармер...',
     'assets/img/films/milen.jpg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('Евгений Гришковец: Предисловие', 8.86, 6838,
     'Лучшие драмы 2020 года (1 место), Лучшие комедии 2020 года (1 место), Лучшие биографические фильмы 2020 года (1 место), Лучшие русские фильмы 2020 года (2 место)',
     '2 апреля 2020 года', 'Россия', 'Евгений Гришковец',
     'Драмы, Комедии, Биографические, Русские', '720p', '12+', '204 мин.',
     'Фильмы 2020 года, Фильмы про актёров, Фильмы про писателей, Фильмы про театр',
     'В 2018 году актер, писатель, драматург и телеведущий Евгений Валерьевич Гришковец...',
     'assets/img/films/evgeni.jpg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('Мадонна: Живой концерт в Лондоне', 8.71, 923,
     'Лучшие концерты 2006 года (1 место), Лучшие документальные фильмы 2006 года (1 место), Лучшие зарубежные фильмы 2006 года (1 место)',
     '22 ноября 2006 года', 'США', 'Йонас Окерлунд',
     'Концерт, Документальные, Зарубежные', '720p', '12+', '121 мин.',
     'Фильмы о музыке, Фильмы про певцов',
     'Документальный фильм посвящен одному из самых впечатляющих концертов Мадонны...',
     'assets/img/films/madonna.jpg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('Дальше – тишина', 8.7, 4744,
     'Лучшие спектакли 1978 года (1 место), Лучшие драмы 1978 года (1 место), Лучшие русские фильмы 1978 года (1 место)',
     '1978', 'СССР', 'Валерий Горбацевич, Анатолий Эфрос',
     'Театр, Драмы, Русские', '720p', '0+', '149 мин.',
     'Фильмы про семью, Фильмы про театр',
     'Действие спектакля происходит в Америке, в семье Куперов...',
     'assets/img/films/tishina.jpg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('Выбор щенка', 8.87, 19568,
     'Лучшие документальные фильмы 2018 года (2 место), Лучшие зарубежные фильмы 2018 года (2 место)',
     '19 января 2018 года', 'США', 'Дон Харди мл., Дана Нахман',
     'Документальные, Зарубежные', '720p', '', '81 мин.',
     'Фильмы 2018 года, Фильмы про собак',
     'В центре сюжета оказывается помет щенков, выведенных для службы в программе «Собаки-поводыри для слепых»...',
     'assets/img/films/dog.jpg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('Иван Васильевич меняет профессию', 8.79, 1145969,
     'Лучшие приключения 1973 года (1 место), Лучшие комедии 1973 года (1 место), Лучшая фантастика 1973 года (1 место), Лучшие семейные фильмы 1973 года (1 место), Лучшие русские фильмы (1 место)',
     '17 сентября 1973 года', 'СССР', 'Леонид Гайдай',
     'Приключения, Комедии, Фантастика, Семейные, Русские', '720p', '6+', '91 мин.',
     'Ох, уж эти мужики!, Фильмы о перемещении во времени, Фильмы про приключения и путешествия',
     'Главный герой Александр Сергеевич Тимофеев, он же Шурик, изобретатель...',
     'assets/img/films/ivan.jpeg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('Джузеппе Москати: Исцеляющая любовь', 8.73, 10821,
     'Лучшие драмы 2007 года (1 место), Лучшие биографические фильмы 2007 года (1 место), Лучшие зарубежные фильмы 2007 года (1 место)',
     '26 сентября 2007 года', 'Италия', 'Джакомо Кампиотти',
     'Драмы, Биографические, Зарубежные', '720p', '', '200 мин.',
     'Фильмы основанные на реальных событиях, Фильмы про врачей или болезни, Фильмы про религию',
     'Одной из величайших кинокартин современности является биографическая история об одном простом итальянце...',
     'assets/img/films/moscati.jpg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('Операция «Ы» и другие приключения Шурика', 8.73, 1078805,
     'Лучшие фильмы про криминал 1965 года (1 место), Лучшие комедии 1965 года (1 место), Лучшие мелодрамы 1965 года (1 место), Лучшие русские фильмы 1965 года (1 место)',
     '23 июля 1965 года', 'СССР', 'Леонид Гайдай',
     'Криминал, Комедии, Мелодрамы, Русские', '720p', '6+', '95 мин.',
     'День дурака (1 апреля), Ох, уж эти мужики!, Фильмы про аферы и мошенников, Фильмы про любовь, Фильмы про учёбу',
     'Сюжет картины состоит из трех новелл, которые объединены фигурой главного героя - Шурика...',
     'assets/img/films/shurik.jpg', 'assets/trailers/wgreen_mile_trailer.mp4'),

    ('1+1', 8.84, 2359112,
     'Лучшие драмы 2011 года (1 место), Лучшие комедии 2011 года (1 место), Лучшие биографические фильмы 2011 года (2 место), Лучшие зарубежные фильмы 2011 года (2 место)',
     '3 октября 2011 года', 'Франция', 'Оливье Накаш, Эрик Толедано',
     'Драмы, Комедии, Биографические, Зарубежные', '720p', '18+', '112 мин.',
     'Никогда не сдавайся, Ох, уж эти мужчины!, Фильмы основанные на реальных событиях, Фильмы про врачей или болезни, Фильмы про дружбу',
     'Филипп очень богатый человек, но в результате несчастного случая его парализовало...',
     'assets/img/films/odin.jpeg', 'assets/trailers/wgreen_mile_trailer.mp4');



CREATE TABLE Users (
                       id INT AUTO_INCREMENT PRIMARY KEY,
                       Login VARCHAR(255) NOT NULL,
                       Password VARCHAR(255) NOT NULL,
                       Email VARCHAR(255),
                       Role VARCHAR(50)
);


CREATE TABLE Favorites (
                           Id INT PRIMARY KEY IDENTITY(1,1),
                           UserId INT NOT NULL,
                           MovieId INT NOT NULL,
                           FOREIGN KEY (UserId) REFERENCES Users(Id),
                           FOREIGN KEY (MovieId) REFERENCES Movies(Id)
);

CREATE UNIQUE INDEX UX_Favorites_UserId_MovieId ON Favorites(UserId, MovieId);